{"class_name": "Model", "keras_version": "2.0.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 16, 112, 112, 3], "name": "conv1_input", "sparse": false}, "inbound_nodes": [], "name": "conv1_input"}, {"class_name": "Conv3D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": false, "data_format": "channels_last", "filters": 64, "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 16, 112, 112, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["conv1_input", 0, 0, {}]]], "name": "conv1"}, {"class_name": "MaxPooling3D", "config": {"name": "pool1", "trainable": false, "data_format": "channels_last", "pool_size": [1, 2, 2], "padding": "valid", "strides": [1, 2, 2]}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "pool1"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "conv2"}, {"class_name": "MaxPooling3D", "config": {"name": "pool2", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "pool2"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3a", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["pool2", 0, 0, {}]]], "name": "conv3a"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3b", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["conv3a", 0, 0, {}]]], "name": "conv3b"}, {"class_name": "MaxPooling3D", "config": {"name": "pool3", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["conv3b", 0, 0, {}]]], "name": "pool3"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv4a", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["pool3", 0, 0, {}]]], "name": "conv4a"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv4b", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["conv4a", 0, 0, {}]]], "name": "conv4b"}, {"class_name": "MaxPooling3D", "config": {"name": "pool4", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["conv4b", 0, 0, {}]]], "name": "pool4"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv5a", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["pool4", 0, 0, {}]]], "name": "conv5a"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv5b", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["conv5a", 0, 0, {}]]], "name": "conv5b"}, {"class_name": "ZeroPadding3D", "config": {"padding": [[0, 0], [1, 1], [1, 1]], "trainable": false, "name": "zeropad5", "data_format": "channels_last"}, "inbound_nodes": [[["conv5b", 0, 0, {}]]], "name": "zeropad5"}, {"class_name": "MaxPooling3D", "config": {"name": "pool5", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["zeropad5", 0, 0, {}]]], "name": "pool5"}, {"class_name": "Flatten", "config": {"trainable": false, "name": "flatten_1"}, "inbound_nodes": [[["pool5", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc8_afew", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "fc8_afew"}], "input_layers": [["conv1_input", 0, 0]], "output_layers": [["fc8_afew", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}